Model: "equation_solver"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
embedding (Embedding)        multiple                  1376
_________________________________________________________________
lstm (LSTM)                  multiple                  82432
_________________________________________________________________
embedding_1 (Embedding)      multiple                  1408
_________________________________________________________________
LuongAttention (LuongAttenti multiple                  16384
_________________________________________________________________
attention_wrapper (Attention multiple                  164352
_________________________________________________________________
basic_decoder (BasicDecoder) multiple                  169899
_________________________________________________________________
basic_decoder_1 (BasicDecode multiple                  169899
=================================================================
Total params: 255,115
Trainable params: 255,115
Non-trainable params: 0
_________________________________________________________________
